app/controllers/todo_items_controller.rb

  def index
    @todo_items = TodoItem.all
---
SELECT "todo_items".* FROM "todo_items"

  def create
    @todo_item = TodoItem.new(todo_item_params)

    respond_to do |format|
      if @todo_item.save
---
INSERT INTO "todo_items" ("title", "description", "done", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "throw the garbage"], ["description", "in my house"], ["done", "f"], ["date", "2014-09-13"], ["created_at", "2015-10-13 22:41:47.052298"], ["updated_at", "2015-10-13 22:41:47.052298"]]

  def update
    respond_to do |format|
      if @todo_item.update(todo_item_params)
---
UPDATE "todo_items" SET "description" = ?, "updated_at" = ? WHERE "todo_items"."id" = ?  [["description", "sdfasfnkbsjkf asfbjs fbasjfbasjf asfkhjaskksadhgfsdhkjddsfsafasfasfsafasfsafsaf"], ["updated_at", "2015-10-14 02:12:01.694537"], ["id", 12]]

  def destroy
    @todo_item.destroy
---
DELETE FROM "todo_items" WHERE "todo_items"."id" = ?  [["id", 2]]